app/controllers/comments_controller.rb

INSERT INTO "comments" ("message", "post_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["message", "some"], ["post_id", 1], ["user_id", 1], ["created_at", "2018-03-10 12:03:44.132200"], ["updated_at", "2018-03-10 12:03:44.132200"]]
---
    def create
      @comment = Comment.create(
          post_id: params[:comment][:post_id],  #key is post_id value is params[:comment][:post_id]
          user_id: current_user.id,
          message: params[:comment][:message]
      )