app/controllers/posts_controller.rb

  def index
    @posts = Post.all.order(:cached_votes_up)
---
SELECT "posts".* FROM "posts" ORDER BY "posts"."cached_votes_up" ASC

  def create
    @post = current_user.posts.build(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "This post should have userid"], ["description", "ahjdgsxuskjch jn"], ["created_at", "2018-02-22 21:38:00.641322"], ["updated_at", "2018-02-22 21:38:00.641322"], ["user_id", 1]]

  def update
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE "posts" SET "image_file_name" = ?, "image_file_size" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["image_file_name", "5.jpg"], ["image_file_size", 77122], ["image_updated_at", "2018-03-11 06:17:04.734590"], ["updated_at", "2018-03-11 06:17:04.893529"], ["id", 18]]